// Завдання 1: Цикл while
// Напишіть програму, яка використовує цикл while для виведення чисел від 1 до 10.

let num = 1;
while (num < 11) {
    console.log(num);
    num++;
}

// Завдання 2: Цикл do...while
// Напишіть програму, яка використовує цикл do...while для виведення чисел від 10 до 1.

let c = 10;
do {
  console.log(c);
  c--;
} while (c);

// Завдання 3: Цикл for
// Напишіть програму, яка використовує цикл for для виведення парних чисел від 2 до 20.

for (let b = 2; b <= 20; b += 2) {
    console.log(b);
  }

  // Завдання 4: Вкладений цикл
// Напишіть програму, яка використовує вкладений цикли for для виведення таблиці множення від 1 до 5.

for (let b = 1; b <= 5; b++) {
    for (let c = 1; c <=10; c++) {
        console.log(`${b} * ${c} = ${b * c}`);
    }
}
    
// Завдання 5: Цикл з використанням continue
// Напишіть програму, яка використовує цикл for для виведення чисел від 1 до 10, але пропускає числа, що діляться на 3 без остачі.

for (let a = 1; a <= 10; a++) {
    if (a % 3 == 0) continue;
    console.log(a);
  }

  // Завдання 6: Цикл з використанням break
// Напишіть програму, яка використовує цикл while для виведення чисел від 1 до 10, але зупиняється, коли число дорівнює 7.

let i = 1;
for (; i < 11; i++) {
    console.log(i)
    if (i == 7)break; 
   }
 console.log;
     